apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_emac.c
                  s32k3xx_freesegment(priv, rxcurr, 1);
                }
              else
                {
                  /* Get a buffer from the free list.  We don't even
                   * check if this is successful because we already
                   * assure the free list is not empty above.
                   */

                  buffer = s32k3xx_allocbuffer(priv);

                  /* Take the buffer from the RX descriptor of the first
                   * free segment, put it into the network device
                   * structure, then replace the buffer in the RX
                   * descriptor with the newly allocated buffer.
                   */

                  DEBUGASSERT(dev->d_buf == NULL);
                  dev->d_buf    = (uint8_t *)rxcurr->des0;
                  rxcurr->des0 = (uint32_t)buffer;

                  /* Make sure that the modified RX descriptor is written
                   * to physical memory.
                   */

                  up_clean_dcache((uintptr_t)rxcurr,
                                  (uintptr_t)rxdesc +
                                  sizeof(struct eth_desc_s));

                  /* Remember where we should re-start scanning and reset
                   * the segment scanning logic
                   */

                  priv->rxhead   = s32k3xx_get_next_rxdesc(priv, rxdesc);
                  s32k3xx_freesegment(priv, rxcurr, 1);

                  /* Force the completed RX DMA buffer to be re-read from
                   * physical memory.
                   */

                  up_invalidate_dcache((uintptr_t)dev->d_buf,
                                      (uintptr_t)dev->d_buf +
                                      MIN(dev->d_len, ALIGNED_BUFSIZE));

                  ninfo("rxhead: %p d_buf: %p d_len: %d\n",
                      priv->rxhead, dev->d_buf, dev->d_len);

                  /* Return success */

                  return OK;
                }
            }
          else
            {
              /* Drop the frame that contains the errors, reset the
               * segment scanning logic, and continue scanning with the
               * next frame.
               */

            nwarn("WARNING: DROPPED RX descriptor errors: "
                "%08" PRIx32 "\n",
                rxdesc->des3);
            s32k3xx_freesegment(priv, rxcurr, 1);
            }
        }
      else
        {
          /* Drop the context descriptors, we are not interested */

          DEBUGASSERT(rxcurr != NULL);
          s32k3xx_freesegment(priv, rxcurr, 1);
        }

      /* Try the next descriptor */

      rxdesc = s32k3xx_get_next_rxdesc(priv, rxdesc);

      /* Force the next RX descriptor to be re-read from physical memory */

      up_invalidate_dcache((uintptr_t)rxdesc,
                           (uintptr_t)rxdesc + sizeof(struct eth_desc_s));
    }

  /* We get here after all of the descriptors have been scanned or when
   * rxdesc points to the first descriptor owned by the DMA. Remember
   * where we left off.
   */

  priv->rxhead = rxdesc;

  ninfo("rxhead: %p\n", priv->rxhead);

  return -EAGAIN;
}

/****************************************************************************
 * Function: s32k3xx_receive
 *
 * Description:
 *   An interrupt was received indicating the availability of a new RX packet
 *
 * Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Global interrupts are disabled by interrupt handling logic.
 *
 ****************************************************************************/

static void s32k3xx_receive(struct s32k3xx_driver_s *priv)
{
  struct net_driver_s *dev = &priv->dev;

  /* Loop while while s32k3xx_recvframe() successfully retrieves valid
   * Ethernet frames.
   */

  while (s32k3xx_recvframe(priv) == OK)
    {
#ifdef CONFIG_NET_PKT
      /* When packet sockets are enabled, feed the frame into the packet
       * tap
       */

     pkt_input(&priv->dev);
#endif

      /* Check if the packet is a valid size for the network buffer
       * configuration (this should not happen)
       */

      if (dev->d_len > CONFIG_NET_ETH_PKTSIZE)
        {
          nwarn("WARNING: DROPPED Too big: %d\n", dev->d_len);

          /* Free dropped packet buffer */

          if (dev->d_buf)
            {
              s32k3xx_freebuffer(priv, dev->d_buf);
              dev->d_buf = NULL;
              dev->d_len = 0;
            }

          continue;
        }

      /* We only accept IP packets of the configured type and ARP packets */

#ifdef CONFIG_NET_IPv4
      if (BUF->type == HTONS(ETHTYPE_IP))
        {
          ninfo("IPv4 frame\n");

          /* Receive an IPv4 packet from the network device */

          ipv4_input(&priv->dev);

          /* If the above function invocation resulted in data that should
           * be sent out on the network, the field  d_len will set to a
           * value > 0.
           */

          if (priv->dev.d_len > 0)
            {
              /* And send the packet */

              s32k3xx_transmit(priv);
            }
        }
      else
#endif
#ifdef CONFIG_NET_IPv6
      if (BUF->type == HTONS(ETHTYPE_IP6))
        {
          ninfo("IPv6 frame\n");

          /* Give the IPv6 packet to the network layer */

          ipv6_input(&priv->dev);

          /* If the above function invocation resulted in data that should
           * be sent out on the network, the field  d_len will set to a
           * value > 0.
           */

          if (priv->dev.d_len > 0)
            {
              /* And send the packet */

              s32k3xx_transmit(priv);
            }
        }
      else
#endif
#ifdef CONFIG_NET_ARP
      if (BUF->type == HTONS(ETHTYPE_ARP))
        {
          ninfo("ARP frame\n");

          /* Handle ARP packet */

          arp_input(&priv->dev);

          /* If the above function invocation resulted in data that should
           * be sent out on the network, the field  d_len will set to a
           * value > 0.
           */

          if (priv->dev.d_len > 0)
            {
              s32k3xx_transmit(priv);
            }
        }
      else
#endif
        {
          nwarn("WARNING: DROPPED Unknown type: %04x\n", BUF->type);
        }

