apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_emac.c
  /* Initialize the free buffer list */

  s32k3xx_initbuffer(priv, &g_txbuffer[0]);

  /* Software reset EMAC */

  s32k3xx_reset(priv);

  /* Init EMAC DMA controller */

  putreg32(EMAC_DMA_MODE_INTM(1), S32K3XX_EMAC_DMA_MODE);
  putreg32(EMAC_DMA_SYSBUS_MODE_AAL, S32K3XX_EMAC_DMA_SYSBUS_MODE);

  /* Initialize EMAC DMA buffers */

  s32k3xx_initbuffers(priv, &g_txtable[0], &g_rxtable[0], &g_rxbuffer[0]);

  s32k3xx_initdma(priv);

  s32k3xx_initmtl(priv);

  /* Set the MAC address */

  putreg32(EMAC_MAC_ADDRESS0_LOW_ADDRLO((mac[3] << 24) | (mac[2] << 16)
                                  | (mac[1] << 8) | mac[0]),
           S32K3XX_EMAC_MAC_ADDRESS0_LOW);
  putreg32(EMAC_MAC_ADDRESS0_HIGH_ADDRHI((mac[5] << 8) | (mac[4])),
           S32K3XX_EMAC_MAC_ADDRESS0_HIGH);

  /* Configure the PHY */

  ret = s32k3xx_initphy(priv, resetphy);
  if (ret < 0)
    {
      nerr("ERROR: Failed to configure the PHY: %d\n", ret);
      return ret;
    }

  putreg32(0, S32K3XX_EMAC_MAC_Q0_TX_FLOW_CTRL);

  putreg32(EMAC_MAC_INTERRUPT_ENABLE_TXSTSIE
           | EMAC_MAC_INTERRUPT_ENABLE_RXSTSIE,
           S32K3XX_EMAC_MAC_INTERRUPT_ENABLE);

  regval = EMAC_MAC_PACKET_FILTER_RA;
#ifdef CONFIG_NET_PROMISCUOUS
  regval |= EMAC_MAC_PACKET_FILTER_PR;
#endif
  putreg32(regval, S32K3XX_EMAC_MAC_PACKET_FILTER);

  /* Mark the interrupt "up" and enable interrupts at the NVIC */

  priv->bifup = true;

#if 0
  up_enable_irq(S32K3XX_IRQ_EMACTMR);
#endif
  up_enable_irq(S32K3XX_IRQ_EMAC_TX);
  up_enable_irq(S32K3XX_IRQ_EMAC_RX);

  return OK;
}

/****************************************************************************
 * Function: s32k3xx_ifup
 *
 * Description:
 *   NuttX Callback: Bring up the Ethernet interface when an IP address is
 *   provided
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int s32k3xx_ifup(struct net_driver_s *dev)
{
  /* The externally available ifup action includes resetting the phy */

  int ret = s32k3xx_ifup_action(dev, true);

  if (ret == OK)
    {
      netdev_carrier_on(dev);
    }

  return ret;
}

/****************************************************************************
 * Function: s32k3xx_ifdown
 *
 * Description:
 *   NuttX Callback: Stop the interface.
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int s32k3xx_ifdown(struct net_driver_s *dev)
{
  struct s32k3xx_driver_s *priv = (struct s32k3xx_driver_s *)dev->d_private;
  irqstate_t flags;

  ninfo("Taking down: %u.%u.%u.%u\n",
        ip4_addr1(dev->d_ipaddr), ip4_addr2(dev->d_ipaddr),
        ip4_addr3(dev->d_ipaddr), ip4_addr4(dev->d_ipaddr));

  /* Flush and disable the Ethernet interrupts at the NVIC */

  flags = enter_critical_section();

  up_disable_irq(S32K3XX_IRQ_EMAC_COMMON);
  up_disable_irq(S32K3XX_IRQ_EMAC_TX);
  up_disable_irq(S32K3XX_IRQ_EMAC_RX);
  up_disable_irq(S32K3XX_IRQ_EMAC_SAFETY);

  /* FIXME clear interrupts */

  /* Cancel the TX timeout timers */

  wd_cancel(&priv->txtimeout);

  /* Put the EMAC in its reset, non-operational state.  This should be
   * a known configuration that will guarantee the s32k3xx_ifup() always
   * successfully brings the interface back up.
   */

  s32k3xx_reset(priv);

  /* Mark the device "down" */

  priv->bifup = false;
  leave_critical_section(flags);

  netdev_carrier_off(dev);

  return OK;
}

/****************************************************************************
 * Function: s32k3xx_txavail_work
 *
 * Description:
 *   Perform an out-of-cycle poll on the worker thread.
 *
 * Input Parameters:
 *   arg - Reference to the NuttX driver state structure (cast to void*)
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called on the higher priority worker thread.
 *
 ****************************************************************************/

static void s32k3xx_txavail_work(void *arg)
{
  struct s32k3xx_driver_s *priv = (struct s32k3xx_driver_s *)arg;

  /* Ignore the notification if the interface is not yet up */

  net_lock();
  if (priv->bifup)
    {
      /* Poll the network for new XMIT data */

      s32k3xx_dopoll(priv);
    }

  net_unlock();
}

/****************************************************************************
 * Function: s32k3xx_txavail
 *
 * Description:
 *   Driver callback invoked when new TX data is available.  This is a
 *   stimulus perform an out-of-cycle poll and, thereby, reduce the TX
 *   latency.
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called in normal user mode
 *
 ****************************************************************************/

static int s32k3xx_txavail(struct net_driver_s *dev)
{
  struct s32k3xx_driver_s *priv = (struct s32k3xx_driver_s *)dev->d_private;

  /* Is our single work structure available?  It may not be if there are
   * pending interrupt actions and we will have to ignore the Tx
   * availability action.
   */

  if (work_available(&priv->pollwork))
    {
      /* Schedule to serialize the poll on the worker thread. */

      work_queue(ETHWORK, &priv->pollwork, s32k3xx_txavail_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Function: s32k3xx_calcethcrc
 *
 * Description:
 *   Function to calculate the CRC used by S32K3XX to check an Ethernet frame
 *
 * Input Parameters:
 *   data   - the data to be checked
 *   length - length of the data
 *
 * Returned Value:
 *   crc32
 *
 * Assumptions:
 *
 ****************************************************************************/

#ifdef CONFIG_NET_MCASTGROUP
static uint32_t s32k3xx_calcethcrc(const uint8_t *data, size_t length)
{
  uint32_t crc    = 0xffffffffu;
  uint32_t count1 = 0;
  uint32_t count2 = 0;

  /* Calculates the CRC-32 polynomial on the multicast group address. */

  for (count1 = 0; count1 < length; count1++)
    {
      uint8_t c = data[count1];

