apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_emac.c
  /* priv->txtail will point to the first segment of the oldest pending
   * "in-flight" TX transfer.  NULL means that there are no active TX
   * transfers.
   */

  priv->txtail   = NULL;
  priv->inflight = 0;

  /* Initialize each TX descriptor */

  for (i = 0; i < CONFIG_S32K3XX_ENET_NTXBUFFERS; i++)
    {
      txdesc = &txtable[i].desc;

#ifdef CHECKSUM_BY_HARDWARE
#if 0
      /* Enable the checksum insertion for the TX frames TODO! */

      txdesc->des0 |= ETH_TDES0_CIC_ALL;
#endif
#endif

      /* Clear Buffer1 address pointer (buffers will be assigned as they
       * are used)
       */

      txdesc->des0 = 0;

      /* Clear the rest of the descriptor as well */

      txdesc->des1 = 0;
      txdesc->des2 = 0;
      txdesc->des3 = 0;
    }

  /* Flush all of the initialized TX descriptors to physical memory */

  up_clean_dcache((uintptr_t)txtable,
                  (uintptr_t)txtable +
                  TXTABLE_SIZE * sizeof(union s32k3xx_desc_u));

  /* Set Channel Tx descriptor ring length register
   * TODO: Why -1 is needed? Without this the ring doesn't wrap around
   * properly but the DMACCATXDR advances to outside the descriptor ring
   */

  putreg32(CONFIG_S32K3XX_ENET_NTXBUFFERS - 1,
           S32K3XX_EMAC_DMA_CH0_TXDESC_RING_LENGTH);

  /* Set Transmit Descriptor List Address Register */

  putreg32((uint32_t)&txtable[0].desc,
           S32K3XX_EMAC_DMA_CH0_TXDESC_LIST_ADDRESS);

  /* Set Transmit Descriptor Tail pointer */

  putreg32((uint32_t)&txtable[0].desc,
           S32K3XX_EMAC_DMA_CH0_TXDESC_TAIL_POINTER);

  /* priv->rxhead will point to the first,  RX descriptor in the chain.
   * This will be where we receive the first incomplete frame.
   */

  priv->rxhead = &rxtable[0].desc;
  priv->rxchbase = &rxtable[0].desc;

  /* Initialize each RX descriptor */

  for (i = 0; i < CONFIG_S32K3XX_ENET_NRXBUFFERS; i++)
    {
      rxdesc = &rxtable[i].desc;

      /* Set Buffer1 address pointer */

      rxdesc->des0 = (uint32_t)&rxbuffer[i * ALIGNED_BUFSIZE];

      /* Set Buffer1 address high bytes */

      rxdesc->des1 = 0;

      /* Set Buffer2 address high bytes */

      rxdesc->des2 = 0;

      /* Set Own bit of the RX descriptor des3 and buffer address valid */

      rxdesc->des3 = EMAC_RDES3_OWN_MASK | EMAC_RDES3_INTE_MASK |
                     EMAC_RDES3_BUF1V_MASK;
    }

  /* Flush all of the initialized RX descriptors to physical memory */

  up_clean_dcache((uintptr_t)rxtable,
                  (uintptr_t)rxtable +
                  RXTABLE_SIZE * sizeof(union s32k3xx_desc_u));

  /* Set Receive Descriptor ring length register
   * TODO: Why -1 is needed? Without this the ring doesn't wrap around
   * properly but the DMACCARXDR advances to outside the descriptor ring
   */

  putreg32(CONFIG_S32K3XX_ENET_NRXBUFFERS - 1,
           S32K3XX_EMAC_DMA_CH0_RXDESC_RING_LENGTH);

  /* Set Receive Descriptor List Address Register */

  putreg32((uint32_t)&rxtable[0].desc,
           S32K3XX_EMAC_DMA_CH0_RXDESC_LIST_ADDRESS);

  /* Set Receive Descriptor Tail pointer Address */

  putreg32((uint32_t)&rxtable[CONFIG_S32K3XX_ENET_NRXBUFFERS - 1].desc,
           S32K3XX_EMAC_DMA_CH0_RXDESC_TAIL_POINTER);
}

/****************************************************************************
 * Function: s32k3xx_initdma
 *
 * Description:
 *   Initialize EMAC DMA controllers
 *
 * Input Parameters:
 *   priv - Reference to the private EMAC driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static void s32k3xx_initdma(struct s32k3xx_driver_s *priv)
{
  uint32_t regval;

  /* EMAC DMA descriptor skip length 4 bytes */

  putreg32(EMAC_DMA_CH0_CONTROL_DSL(4), S32K3XX_EMAC_DMA_CH0_CONTROL);

  /* Set EMAC_DMA_CH0_TX_CONTROL register */

  putreg32(EMAC_DMA_CH0_TX_CONTROL_TXPBL(32) | EMAC_DMA_CH0_TX_CONTROL_OSF,
           S32K3XX_EMAC_DMA_CH0_TX_CONTROL);

  /* DMA TX start transmitting */

  regval  = getreg32(S32K3XX_EMAC_DMA_CH0_TX_CONTROL);
  regval |= EMAC_DMA_CH0_TX_CONTROL_ST;
  putreg32(regval, S32K3XX_EMAC_DMA_CH0_TX_CONTROL);

  /* Set EMAC_DMA_CH0_RX_CONTROL register */

  putreg32(EMAC_DMA_CH0_RX_CONTROL_RXPBL(32) |
           EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_Y(CONFIG_NET_ETH_PKTSIZE >> 2),
           S32K3XX_EMAC_DMA_CH0_RX_CONTROL);

  /* DMA RX start receiving */

  regval  = getreg32(S32K3XX_EMAC_DMA_CH0_RX_CONTROL);
  regval |= EMAC_DMA_CH0_RX_CONTROL_SR;
  putreg32(regval, S32K3XX_EMAC_DMA_CH0_RX_CONTROL);

  /* DMA enable interrupts */

  regval = EMAC_DMA_CH0_INTERRUPT_ENABLE_AIE |
           EMAC_DMA_CH0_INTERRUPT_ENABLE_NIE |
           EMAC_DMA_CH0_INTERRUPT_ENABLE_RIE |
           EMAC_DMA_CH0_INTERRUPT_ENABLE_TIE;
  putreg32(regval, S32K3XX_EMAC_DMA_CH0_INTERRUPT_ENABLE);
}

/****************************************************************************
 * Function: s32k3xx_reset
 *
 * Description:
 *   Put the EMAC in the non-operational, reset state
 *
 * Input Parameters:
 *   priv - Reference to the private ENET driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static uint32_t s32k3xx_reset(struct s32k3xx_driver_s *priv)
{
  const uint32_t timeout = 1000;
  uint32_t wait_ack;

  /* Reset emac using DMA SWR bit */

  putreg32(EMAC_DMA_MODE_SWR, S32K3XX_EMAC_DMA_MODE);

  for (wait_ack = 0; wait_ack < timeout; wait_ack++)
    {
      if ((getreg32(S32K3XX_EMAC_DMA_MODE) & EMAC_DMA_MODE_SWR) == 0)
        {
          return true;
        }

      up_udelay(10);
    }

  return false;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Function: s32k3xx_netinitialize
 *
 * Description:
 *   Initialize the Ethernet controller and driver
 *
 * Input Parameters:
 *   intf - In the case where there are multiple EMACs, this value
 *          identifies which EMAC is to be initialized.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

int s32k3xx_netinitialize(int intf)
{
  struct s32k3xx_driver_s *priv;
#ifdef CONFIG_NET_ETHERNET
  uint32_t uidl;
  uint32_t uidml = 0;
  uint8_t *mac;
#endif
  int ret;
  uint32_t regval;

  /* Get the interface structure associated with this interface number. */

  DEBUGASSERT(intf < CONFIG_S32K3XX_ENET_NETHIFS);
  priv = &g_enet[intf];

