apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_emac.c
  /* NOTE:  ENET clocking was enabled and configured by board-specific logic
   * when other clocking was configured.
   */

  /* Configure all ENET/RMII pins */

  /* Note RMII only supported for now */

  regval = getreg32(S32K3XX_DCM_GPR_DCMRWF1);
  regval |= DCM_GPR_DCMRWF1_RMII_MII_SEL_RMII;
  putreg32(regval, S32K3XX_DCM_GPR_DCMRWF1);

  s32k3xx_pinconfig(PIN_EMAC_MII_RMII_MDC);
  s32k3xx_pinconfig(PIN_EMAC_MII_RMII_MDIO);
  s32k3xx_pinconfig(PIN_EMAC_MII_RMII_RX_DV);
  s32k3xx_pinconfig(PIN_EMAC_MII_RMII_RX_ER);
  s32k3xx_pinconfig(PIN_EMAC_MII_RMII_RXD0);
  s32k3xx_pinconfig(PIN_EMAC_MII_RMII_RXD1);
  s32k3xx_pinconfig(PIN_EMAC_MII_RMII_TX_CLK);
  s32k3xx_pinconfig(PIN_EMAC_MII_RMII_TX_EN);
  s32k3xx_pinconfig(PIN_EMAC_MII_RMII_TXD0);
  s32k3xx_pinconfig(PIN_EMAC_MII_RMII_TXD1);

  /* Attach the Ethernet MAC IEEE 1588 timer interrupt handler */

#if 0
  if (irq_attach(S32K3XX_IRQ_EMACTMR, s32k3xx_tmrinterrupt, NULL))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach EMACTMR IRQ\n");
      return -EAGAIN;
    }
#endif

  /* Attach the Ethernet interrupt handler */

  if (irq_attach(S32K3XX_IRQ_EMAC_COMMON, s32k3xx_enet_interrupt, NULL))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach EMACTX IRQ\n");
      return -EAGAIN;
    }

  if (irq_attach(S32K3XX_IRQ_EMAC_TX, s32k3xx_enet_interrupt, NULL))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach EMACTX IRQ\n");
      return -EAGAIN;
    }

  if (irq_attach(S32K3XX_IRQ_EMAC_RX, s32k3xx_enet_interrupt, NULL))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach EMACRX IRQ\n");
      return -EAGAIN;
    }

  /* Initialize the driver structure */

  memset(priv, 0, sizeof(struct s32k3xx_driver_s));
  priv->dev.d_ifup    = s32k3xx_ifup;     /* I/F up (new IP address) callback */
  priv->dev.d_ifdown  = s32k3xx_ifdown;   /* I/F down callback */
  priv->dev.d_txavail = s32k3xx_txavail;  /* New TX data callback */
#ifdef CONFIG_NET_MCASTGROUP
  priv->dev.d_addmac  = s32k3xx_addmac;   /* Add multicast MAC address */
  priv->dev.d_rmmac   = s32k3xx_rmmac;    /* Remove multicast MAC address */
#endif
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = s32k3xx_ioctl;    /* Support PHY ioctl() calls */
#endif
  priv->dev.d_private = g_enet;           /* Used to recover private state from dev */

#ifdef CONFIG_NET_ETHERNET
  /* Determine a semi-unique MAC address from MCU UID
   * We use UID Low and Mid Low registers to get 64 bits, from which we keep
   * 48 bits.  We then force unicast and locally administered bits (b0 and
   * b1, 1st octet)
   */

  mac    = priv->dev.d_mac.ether.ether_addr_octet;
  uidl   = getreg32(S32K3XX_UTEST_UID);
  uidml  = getreg32(S32K3XX_UTEST_UID + 0x4);

  uidml |= 0x00000200;
  uidml &= 0x0000feff;

  mac[0] = (uidml & 0x0000ff00) >> 8;
  mac[1] = (uidml & 0x000000ff);
  mac[2] = (uidl &  0xff000000) >> 24;
  mac[3] = (uidl &  0x00ff0000) >> 16;
  mac[4] = (uidl &  0x0000ff00) >> 8;
  mac[5] = (uidl &  0x000000ff);
#endif

#ifdef CONFIG_S32K3XX_ENET_PHYINIT
  /* Perform any necessary, one-time, board-specific PHY initialization */

  ret = s32k3xx_phy_boardinitialize(0);
  if (ret < 0)
    {
      nerr("ERROR: Failed to initialize the PHY: %d\n", ret);
      return ret;
    }
#endif

  /* Put the interface in the down state.  This usually amounts to resetting
   * the device and/or calling s32k3xx_ifdown().
   */

  s32k3xx_ifdown(&priv->dev);

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_ETHERNET);

  UNUSED(ret);
  return OK;
}

/****************************************************************************
 * Name: arm_netinitialize
 *
 * Description:
 *   Initialize the first network interface.  If there are more than one
 *   interface in the chip, then board-specific logic will have to provide
 *   this function to determine which, if any, Ethernet controllers should
 *   be initialized.
 *
 ****************************************************************************/

#if CONFIG_S32K3XX_ENET_NETHIFS == 1 && !defined(CONFIG_NETDEV_LATEINIT)
void arm_netinitialize(void)
{
  s32k3xx_netinitialize(0);
}
#endif

#endif /* CONFIG_S32K3XX_ENET */
